
  <details>
  <summary>terraform/backends - Terraform Plan Output (click to expand)</summary>
  
```
postgresql_role.mgmt_role: Refreshing state... [id=mgmt]
postgresql_database.mgmt_db: Refreshing state... [id=mgmt]
postgresql_grant.mgmt_grant: Refreshing state... [id=mgmt_mgmt_database]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # postgresql_database.hub_db will be created
  + resource "postgresql_database" "hub_db" {
      + allow_connections = true
      + connection_limit  = -1
      + encoding          = (known after apply)
      + id                = (known after apply)
      + is_template       = (known after apply)
      + lc_collate        = (known after apply)
      + lc_ctype          = (known after apply)
      + name              = "hub"
      + owner             = (known after apply)
      + tablespace_name   = (known after apply)
      + template          = (known after apply)
    }

  # postgresql_grant.hub_grant will be created
  + resource "postgresql_grant" "hub_grant" {
      + database          = "hub"
      + id                = (known after apply)
      + object_type       = "database"
      + privileges        = [
          + "ALL",
        ]
      + role              = "hub"
      + with_grant_option = false
    }

  # postgresql_grant.mgmt_grant must be replaced
-/+ resource "postgresql_grant" "mgmt_grant" {
      ~ id                = "mgmt_mgmt_database" -> (known after apply)
      ~ privileges        = [ # forces replacement
          - "CONNECT",
          - "CREATE",
          - "TEMPORARY",
          + "ALL",
        ]
        # (4 unchanged attributes hidden)
    }

  # postgresql_role.hub_role will be created
  + resource "postgresql_role" "hub_role" {
      + bypass_row_level_security = false
      + connection_limit          = -1
      + create_database           = false
      + create_role               = false
      + encrypted_password        = true
      + id                        = (known after apply)
      + inherit                   = true
      + login                     = true
      + name                      = "hub"
      + password                  = (sensitive value)
      + replication               = false
      + skip_drop_role            = false
      + skip_reassign_owned       = false
      + superuser                 = false
      + valid_until               = "infinity"
    }

Plan: 4 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan_output.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan_output.tfplan"

```
  </details>
